app/controllers/school_classes_controller.rb

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Being Rad AF 101"], ["updated_at", "2021-05-17 15:28:35.033496"], ["id", 1]]